# Review from last week

## R.1 Importing data

In [35]:
#Import pandas
import pandas as pd

### R.1.1 Import

In [36]:
pd.read_csv("yen.csv")

            Date     Yen  US_2yr  JP_2yr
0     2000-01-04  102.98    6.30   0.402
1     2000-01-05  103.87    6.38   0.380
2     2000-01-06  105.26    6.35   0.388
3     2000-01-07  105.45    6.31   0.406
4     2000-01-11  105.77    6.45   0.421
...          ...     ...     ...     ...
4712  2020-04-07  108.97    0.28  -0.132
4713  2020-04-08  108.74    0.27  -0.132
4714  2020-04-09  108.53    0.23  -0.147
4715  2020-04-14  107.22    0.23  -0.170
4716  2020-04-15  107.41    0.20  -0.160

[4717 rows x 4 columns]

### R.1.2 Import AND SAVE

In [37]:
#The leftside is your variable name
df = pd.read_csv('yen.csv')

## R.2. Pandas

### R.2.1 Import other libraries

In [38]:
import os
import sys
import seaborn as sns
import warnings
if not sys.warnoptions:
    warnings.simplefilter("ignore")
import quandl
import requests
import re
import numpy as np
import datetime

## R. 2.2 Review important functions:
- select
- filter
- arrange
- mutate
- summarise
- groupby

### R.2.2.1 Select: column

In [39]:
#One column
df[['Yen']].head(2) #Basic method
#df.loc[:, ["Yen"]] #.loc method

#Mulitple columns
df[['Yen', "US_2yr"]].head(2) #Basic method
#df.loc[:,['Yen', "US_2yr"]] #.loc method

      Yen  US_2yr
0  102.98    6.30
1  103.87    6.38

### R.2.2.2 Filter: row

In [40]:
condition = df.Yen<76
df[condition] #Basic method
#df.loc[condition,:] #.loc method

            Date    Yen  US_2yr  JP_2yr
2752  2011-10-25  75.77    0.26   0.146
2754  2011-10-27  75.84    0.31   0.141
2755  2011-10-28  75.77    0.28   0.143

### R.2.2.3 Arrange

In [41]:
df.Yen.sort_values().head(2)

2755    75.77
2752    75.77
Name: Yen, dtype: float64

### R.2.2.4 Mutate

In [42]:
df['diff'] = df.US_2yr-df.JP_2yr #Create new variable
df[['diff']].head(2) #Show new variable

    diff
0  5.898
1  6.000

### R.2.2.5 Summarise

In [43]:
df.describe()

               Yen       US_2yr       JP_2yr         diff
count  4717.000000  4717.000000  4717.000000  4717.000000
mean    106.642036     2.107174     0.166620     1.940554
std      13.102508     1.711472     0.299082     1.569514
min      75.770000     0.170000    -0.372000     0.032000
25%     100.530000     0.680000     0.009000     0.567000
50%     109.030000     1.630000     0.100000     1.590000
75%     116.630000     3.080000     0.247000     2.982000
max     134.820000     6.930000     1.080000     6.538000

### R.2.2.6 Groupby with summarise

In [44]:
#df.groupby('Group_Variable')['Variable_2'].mean()

## R.3 Overview of data

### R.3.1 Show data

In [45]:
df.head(3) #Show data

         Date     Yen  US_2yr  JP_2yr   diff
0  2000-01-04  102.98    6.30   0.402  5.898
1  2000-01-05  103.87    6.38   0.380  6.000
2  2000-01-06  105.26    6.35   0.388  5.962

### R.3.2 Data types

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4717 entries, 0 to 4716
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    4717 non-null   object
 1   Yen     4717 non-null   float64
 2   US_2yr  4717 non-null   float64
 3   JP_2yr  4717 non-null   float64
 4   diff    4717 non-null   float64
dtypes: float64(4), object(1)
memory usage: 184.4+ KB

### R.3.3 Summary statistics

In [47]:
df.describe()

               Yen       US_2yr       JP_2yr         diff
count  4717.000000  4717.000000  4717.000000  4717.000000
mean    106.642036     2.107174     0.166620     1.940554
std      13.102508     1.711472     0.299082     1.569514
min      75.770000     0.170000    -0.372000     0.032000
25%     100.530000     0.680000     0.009000     0.567000
50%     109.030000     1.630000     0.100000     1.590000
75%     116.630000     3.080000     0.247000     2.982000
max     134.820000     6.930000     1.080000     6.538000

# Week 2

# 1. Importing files
## 1.1 Understanding file paths

<img src="Screenshots/File_path.png">

## 1.2 Our current working directory

In [24]:
os.getcwd()

'/Users/corybaird/Desktop/Phd_jupyter/Learn_Python/2nd_session'

In [25]:
path = os.getcwd() #We can also set the current working directory as variable
path+"/sub_folder"
os.path.join(path, "sub_folder")

'/Users/corybaird/Desktop/Phd_jupyter/Learn_Python/2nd_session/sub_folder'

## 1.3 More on importing excel files
### 1.3.1 From: current working directory
- Simply write the name of the file in quotes

In [48]:
pd.read_csv('yen.csv').head(2)

         Date     Yen  US_2yr  JP_2yr
0  2000-01-04  102.98    6.30   0.402
1  2000-01-05  103.87    6.38   0.380

### 1.3.2 From: A subfolder

In [49]:
df = pd.read_csv("Sub_directory/Covid_TS_global.csv")

# 2. Dummy variable

## 2.1 Create overvalued variable

In [87]:
df = pd.read_csv('yen.csv')
df.Yen.describe()

count    4717.000000
mean      106.642036
std        13.102508
min        75.770000
25%       100.530000
50%       109.030000
75%       116.630000
max       134.820000
Name: Yen, dtype: float64

## 2.2 Create overweight var if under 85

In [95]:
df['Overvalued'] = pd.get_dummies(df.Yen<85, drop_first=True)
df.head(3)

         Date     Yen  US_2yr  JP_2yr  Overvalued
0  2000-01-04  102.98    6.30   0.402           0
1  2000-01-05  103.87    6.38   0.380           0
2  2000-01-06  105.26    6.35   0.388           0

# 3. Mapping values

In [104]:
df.Overvalued.map({0:'Normal', 1:"Over-valued"})

0       Normal
1       Normal
2       Normal
3       Normal
4       Normal
         ...
4712    Normal
4713    Normal
4714    Normal
4715    Normal
4716    Normal
Name: Overvalued, Length: 4717, dtype: object

# 4. Omit na variables

In [123]:
df = df.shift(2)
df.head(2)

  Date  Yen  US_2yr  JP_2yr  Overvalued
0  NaN  NaN     NaN     NaN         NaN
1  NaN  NaN     NaN     NaN         NaN

In [141]:
df.dropna().head(2)
#df= df.dropna()

# 5. Create cut off variables

## 5.1 Create cutoffs

In [142]:
yen_cutoffs= [x for x in range(80,150) if x%20==0]
yen_cutoffs

[80, 100, 120, 140]

## 5.2 Mutate cutoff variables

In [144]:
yen_groups = pd.cut(df["Yen"].sort_values().values, yen_cutoffs)
df['yen_group'] = yen_groups
df.dropna()

            Date     Yen  US_2yr  JP_2yr  Overvalued   yen_group
522   2002-03-08  128.10    3.60   0.065         0.0   (80, 100]
523   2002-03-11  127.95    3.59   0.068         0.0   (80, 100]
524   2002-03-12  128.75    3.56   0.063         0.0   (80, 100]
525   2002-03-13  129.46    3.49   0.060         0.0   (80, 100]
526   2002-03-14  128.78    3.63   0.058         0.0   (80, 100]
...          ...     ...     ...     ...         ...         ...
4699  2020-02-28  107.95    0.86  -0.258         0.0  (120, 140]
4700  2020-03-02  107.92    0.84  -0.264         0.0  (120, 140]
4701  2020-03-03  107.55    0.71  -0.250         0.0  (120, 140]
4702  2020-03-04  107.28    0.67  -0.280         0.0  (120, 140]
4703  2020-03-05  106.70    0.59  -0.251         0.0  (120, 140]

[4182 rows x 6 columns]

In [136]:
df.groupby(yen_groups)['JP_2yr'].mean()

(80, 100]     0.095605
(100, 120]    0.232338
(120, 140]   -0.162390
Name: JP_2yr, dtype: float64